{
  "home": {
    "title": {
      "solution": "Giải pháp ",
      "name": "quản lý văn bằng chứng chỉ ",
      "application": "ứng dụng",
      "description": "Dự án Web3 được xây dựng trên nền tảng Blockchain đảm bảo tính minh bạch cho văn bằng chứng chỉ"
    },
    "card": {
      "title": "Tìm kiếm văn bằng chứng chỉ",
      "placeholder": "Nhập số chứng chỉ",
      "button": "Xác thực",
      "button_qr_code": "Mở camera để quét QR code"
    },
    "technology": {
      "title": "Các công nghệ sử dụng",
      "view_more": "Xem thêm",
      "nextjs": {
        "descryption_1": "Next.js là framework dựa trên React giúp tăng tốc quá trình phát triển web bằng cách hỗ trợ render phía máy chủ (SSR) và tạo trang tĩnh (SSG)",
        "descryption_2": "Nó cung cấp một loạt các tính năng, bao gồm routing, API routes, tối ưu hóa hình ảnh và hỗ trợ TypeScript/JavaScript, làm cho nó là lựa chọn mạnh mẽ cho việc xây dựng các ứng dụng web linh hoạt và hiệu suất cao."
      },
      "mongodb": {
        "descryption_1": "MongoDB là cơ sở dữ liệu hướng tài liệu NoSQL được sử dụng rộng rãi, lưu trữ dữ liệu trong các tài liệu linh hoạt dạng JSON, cho phép phát triển và lặp lại nhanh chóng.",
        "descryption_2": "Khả năng mở rộng theo chiều ngang và khả năng truy vấn mạnh mẽ khiến nó trở thành lựa chọn ưu tiên để xử lý các tập dữ liệu lớn, phi cấu trúc."
      },
      "golang": {
        "descryption_1": "Go là ngôn ngữ lập trình được biên dịch tĩnh do Google thiết kế, ưu tiên tính đơn giản, xử lý đồng thời và hiệu suất cao.",
        "descryption_2": "Nó đã trở nên phổ biến trong việc xây dựng các dịch vụ backend có khả năng mở rộng, ứng dụng cloud-native và các hệ thống phân tán."
      },
      "fabric": {
        "descryption_1": "Hyperledger Fabric là framework blockchain được cấp phép được thiết kế cho các giải pháp doanh nghiệp, cung cấp kiến trúc module và các giao thức đồng thuận có thể cắm được.",
        "descryption_2": "Nó hỗ trợ hợp đồng thông minh (chaincode) và cung cấp khả năng mở rộng, bảo mật và hiệu suất cao cho các mạng kinh doanh phức tạp."
      }
    },
    "appilcation": {
      "title": "Luồng ứng dụng",
      "title_1": "Giao diện người dùng (Next.js)",
      "descryption_1": "Người dùng tương tác với ứng dụng web được xây dựng trên Next.js, xử lý định tuyến, hiển thị và logic phía máy khách.",
      "title_2": "Yêu cầu API (Backend Go)",
      "descryption_2": "Khi người dùng thực hiện các hành động (ví dụ: gửi dữ liệu hoặc yêu cầu thông tin), Next.js gửi yêu cầu HTTP đến API backend Go.",
      "title_3": "Logic nghiệp vụ & Thao tác cơ sở dữ liệu (Go + MongoDB)",
      "descryption_3": "Backend Go xử lý yêu cầu, áp dụng logic nghiệp vụ và tương tác với MongoDB để đọc/ghi dữ liệu ứng dụng (hồ sơ người dùng, metadata, v.v.).",
      "title_4": "Giao dịch Blockchain (Fabric Hyperledger)",
      "descryption_4": "Đối với các hoạt động quan trọng, có thể kiểm toán (ví dụ: hồ sơ giao dịch, quyền sở hữu tài sản), backend Go giao tiếp với Fabric Hyperledger để gửi và truy vấn các giao dịch blockchain đảm bảo tính minh bạch và không thể thay đổi.",
      "title_5": "Xử lý phản hồi",
      "descryption_5": "Backend Go gửi dữ liệu đã xử lý hoặc kết quả giao dịch trở lại frontend Next.js.",
      "title_6": "Phản hồi người dùng",
      "descryption_6": "Frontend cập nhật giao diện người dùng để phản ánh trạng thái mới nhất, cung cấp phản hồi hoặc cập nhật giao diện dựa trên phản hồi từ backend."
    }
  },
  "header": {
    "login": "Đăng nhập",
    "avatar": {
      "settings": "Cài đặt",
      "profile": "Hồ sơ",
      "logout": "Đăng xuất",
      "logout_dialog": {
        "title": "Đăng xuất",
        "description": "Bạn có chắc chắn muốn đăng xuất không?",
        "cancel": "Hủy bỏ",
        "confirm": "Đăng xuất"
      }
    }
  }
}
